# Cask: install binaries
tap 'caskroom/cask'

# The recommended way to use Heroku
brew 'heroku-toolbelt'

# zsh
brew 'zsh'
# autojump for zsh plugins
brew 'autojump'

# lightweight and flexible command-line JSON processor.
brew 'jq'

# Postgresql
brew 'postgresql'

# Ansible
brew 'ansible'

# so :Rtags works
brew 'ctags'

# It's vim & neovim
brew 'mercurial'
brew 'vim'
brew 'neovim'

# Used in Rails projects

# python version manager
brew 'pyenv'
brew 'pyenv-virtualenv'

# Docker stuffs
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'

# Lets us do `brew services restart postgres`, etc
tap 'homebrew/services'

# thoughtbot stuff like rcm
tap 'thoughtbot/formulae'
brew 'rcm'

# yarn
brew 'yarn'

# asdf version manager
brew 'asdf'
# required to install nodejs via asdf
brew 'gpg'

# elixir
brew 'elixir'
brew 'erlang'

# scala
brew 'sbt'

# awscli
brew 'awscli'

# Graphicsmagick
brew 'graphicsmagick'

# watchman for js storybook watcher
# brew 'watchman'

# openconnect
brew 'openconnect'
brew 'openssl'

# dive
brew 'dive'

# stuffs recommended in: https://blog.testdouble.com/posts/2020-04-07-favorite-things/
# tldr - a better man
brew 'tldr'
# ngrok
cask 'ngrock'
# exa - a better ls
brew 'exa'
# bat - a better cat
brew 'bat'
# grc - a slick tool for colorizing log output
brew 'grc'
# rg - ripgrep for fast search
brew 'rg'
# hub
brew 'hub'
# Fuzzy finder
brew 'fzf'
# HTTPie - a better curl
brew 'httpie'
# tig -  a command line visual interface for git
brew 'tig'
