# The recommended way to use Heroku
brew 'heroku-toolbelt'

# lightweight and flexible command-line JSON processor.
brew 'jq'

# Postgresql
brew 'postgresql'

# Ansible
brew 'ansible'

# a better ack/grep
brew 'the_silver_searcher'

# so :Rtags works
brew 'ctags'

# It's vim & neovim
brew 'mercurial'
brew 'vim'
brew 'neovim'

# Used in Rails projects
brew 'phantomjs'

# python version manager
brew 'pyenv'
brew 'pyenv-virtualenv'

# Fast GitHub client
brew 'hub'

# Fuzzy finder
brew 'fzf'

# Docker stuffs
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'

# Lets us do `brew services restart postgres`, etc
tap 'homebrew/services'

# thoughtbot stuff like rcm
tap 'thoughtbot/formulae'
brew 'rcm'

# yarn
brew 'yarn'

# elixir
brew 'elixir'
brew 'erlang'

# scala
brew 'sbt'

# awscli
brew 'awscli'

# Graphicsmagick
brew 'graphicsmagick'

# watchman for js storybook watcher
brew 'watchman'

# openconnect
brew 'openconnect'
brew 'openssl'

# Cask: install binaries
tap 'caskroom/cask'
cask 'alfred'
cask 'dropbox'
